In [1]:
import numpy as np
import pandas as pd

In [7]:
# creating DataFrame 
df = pd.DataFrame(np.arange(0,20).reshape(5,4),
                  index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'],
                  columns=['Column1', 'Column2', 'Column3', 'Column4'])

In [8]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
# df.to_csv('Test1.csv') # to save a file as a csv

In [10]:
# accessing the elemnets
# 1. .loc 2. .iloc - index location

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [11]:
type(df.loc['Row1'])

pandas.core.series.Series

In [13]:
df.iloc[:, :] # [row, col]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [14]:
df.iloc[:, 1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [15]:
df.iloc[0:3, 0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9

In [16]:
type(df.iloc[0:3, 0:2])

pandas.core.frame.DataFrame

In [17]:
# converting DataFrame into array

df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [20]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [21]:
# to check null values

df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [23]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [25]:
df[['Column1','Column3']]

      Column1  Column3
Row1        0        2
Row2        4        6
Row3        8       10
Row4       12       14
Row5       16       18